## Plan Result (prod_app_registrations)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.azurerm_role_assignment.this[&#34;DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Platform-Prod&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azurerm_role_assignment.this["DTS Orphaned Resource Cleanup-Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c4fb60b5-f376-4e17-9751-0e35850235de"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Orphan Resource Cleanup Read/Delete"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":47,"Program":"tfcmt","SHA1":"","Target":"prod_app_registrations","Vars":{}} -->